In [11]:
import pandas as pd
from IPython.display import display

In [9]:
data = {'Name' : ["John", "Anna", "Peter", "Linda"], 
        'Location' : ["New York", "Paris", "Berlin", "London"],
       'Age' : [24, 13, 53, 33]}
print(data)

{'Name': ['John', 'Anna', 'Peter', 'Linda'], 'Location': ['New York', 'Paris', 'Berlin', 'London'], 'Age': [24, 13, 53, 33]}

In [10]:
data_pandas = pd.DataFrame(data) #판다스 데이터 형으로 프레임 만들어 반환
data_pandas #정형데이터(틀에 맞게 정형화됨)
#name, location, age : feature
#data : 샘플

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [12]:
display(data_pandas)

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [14]:
data_pandas[data_pandas.Age > 30] #딕셔너리 컴프리헨션

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33